# Pandas Assignment 3
# US - Baby Names


### Step 1. Import the necessary libraries
#import library pandas

In [1]:
import pandas as pd

### Step 2. Import the dataset

### Step 3. Assign it to a variable called baby_names.

In [2]:
Baby_Names=pd.read_csv("US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [3]:
Baby_Names.head(10)

   Unnamed: 0     Id      Name  Year Gender State  Count
0       11349  11350      Emma  2004      F    AK     62
1       11350  11351   Madison  2004      F    AK     48
2       11351  11352    Hannah  2004      F    AK     46
3       11352  11353     Grace  2004      F    AK     44
4       11353  11354     Emily  2004      F    AK     41
5       11354  11355   Abigail  2004      F    AK     37
6       11355  11356    Olivia  2004      F    AK     33
7       11356  11357  Isabella  2004      F    AK     30
8       11357  11358    Alyssa  2004      F    AK     29
9       11358  11359    Sophia  2004      F    AK     28

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [4]:
del Baby_Names['Unnamed: 0']
del Baby_Names['Id']
Baby_Names.head()

      Name  Year Gender State  Count
0     Emma  2004      F    AK     62
1  Madison  2004      F    AK     48
2   Hannah  2004      F    AK     46
3    Grace  2004      F    AK     44
4    Emily  2004      F    AK     41

### Step 6. Is there more male or female names in the dataset?

In [5]:
Baby_Names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

In [6]:
print('Number of Female names given in the dataset are more than number of male names')

Number of Female names given in the dataset are more than number of male names

### Step 7. Group the dataset by name and assign to names

In [7]:
Names = Baby_Names.groupby('Name').sum()
Names.sort_values(by='Count',ascending=False).head()

             Year   Count
Name
Jacob     1141099  242874
Emma      1137085  214852
Michael   1161152  214405
Ethan     1139091  209277
Isabella  1137090  204798

### Step 8. How many different names exist in the dataset?

In [8]:
len(Names)

17632

### Step 9. What is the name with most occurrences?

In [9]:
Names.idxmax()

Year     Riley
Count    Jacob
dtype: object

### Step 10. How many different names have the least occurrences?

In [10]:
len(Names[Names['Count']==Names['Count'].min()])

2578

### Step 11. What is the median name occurrence?

In [11]:
Names[Names['Count'] == Names['Count'].median()]

          Year  Count
Name
Aishani  14078     49
Alara    16079     49
Alysse   16057     49
Ameir    16086     49
Anely    16071     49
...        ...    ...
Sriram   14054     49
Trinton  16069     49
Vita     14075     49
Yoni     16060     49
Zuleima  14050     49

[66 rows x 2 columns]

### Step 12. What is the standard deviation of names?

In [12]:
print('Standard deviation of Names=',Names.Count.std())

Standard deviation of Names= 11006.069467891111

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [13]:
Names.Count.describe()

count     17632.000000
mean       2008.932169
std       11006.069468
min           5.000000
25%          11.000000
50%          49.000000
75%         337.000000
max      242874.000000
Name: Count, dtype: float64